#+TITLE: Orgmode Notes

* Tables

** Export Specific Table

Use ~org-table-export~ to export specific table within org-mode document.

After running this function from ~M-x org-table-export~, it'll prompt you
to name the save file, and then how to save the table.

Some examples are:

- ~orgtbl-to-tsv~
- ~orgtbl-to-csv~

* Babel

** Remove all code block results

Source: http://lists.gnu.org/archive/html/emacs-orgmode/2011-07/msg01572.html

#+BEGIN_SRC emacs-lisp :results silent
(org-babel-map-src-blocks nil (org-babel-remove-result))
#+END_SRC

** Change how babel handles output

Use ~:results output~ to print out some output from languages.

#+BEGIN_SRC python
def f():
    print("Hello, world!")
#+END_SRC

#+RESULTS:
: None

But if you add the results output then

#+BEGIN_SRC python :results output
def f():
    print("Hello, world!")
#+END_SRC

#+RESULTS:
: Hello, world!

Source: https://emacs.stackexchange.com/a/17928/

* TODO Items

~C-c C-x o~ to trigger ordered property of checkboxes.
